DBD   NAME=CUSTSEG,ACCESS=HIDAM
DATASET DD1=IMSSEGA
SEGM  NAME=ROOTSEG,PARENT=0
       FIELD NAME=ROOTKEY,START=1,LENGTH=8,KEY=YES
       FIELD NAME=REGION,START=9,LENGTH=3
SEGM  NAME=ADDRSEG,PARENT=ROOTSEG
       FIELD NAME=ADDRKEY,START=1,LENGTH=5,KEY=YES
       FIELD NAME=ZIPCODE,START=6,LENGTH=5
SEGM  NAME=ORDERSEG,PARENT=ROOTSEG
       FIELD NAME=ORDKEY,START=1,LENGTH=12,KEY=YES
       FIELD NAME=STATUS,START=13,LENGTH=1
PROCOPT=G
END
