DBD NAME=PAYDBD,ACCESS=HDAM
DATASET DD1=IMS01,DEVICE=3390
SEGM NAME=PAYROOT,PARENT=0
FIELD NAME=EMPID,START=1,LENGTH=8
SEGM NAME=PAYHIST,PARENT=PAYROOT
FIELD NAME=PAYDATE,START=1,LENGTH=8
FIELD NAME=PAYAMT,START=9,LENGTH=9
